docker/app/app/services/visit_keeper_service.rb

DELETE FROM `visits`
DELETE FROM `page_views`
---
  def initialize(visits)
    Visit.delete_all
    PageView.delete_all

SELECT `visits`.* FROM `visits` ORDER BY `visits`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `visits`
INSERT INTO `visits` (`evid`, `created_at`, `updated_at`) VALUES ('00000000-0000-0000-0000-000000000000', '2020-09-13 10:43:16.703577', '2020-09-13 10:43:16.703577')
DELETE FROM `visits` WHERE `visits`.`id` = 16
---
  def next_auto_increment
    if Visit.count > 0
      Visit.last.id + 1
    else
      tmp_visit = Visit.create(evid: '00000000-0000-0000-0000-000000000000')
      auto_increment = tmp_visit.id + 1
      tmp_visit.delete

INSERT INTO `visits` (`evid`,`vendor_site_id`,`vendor_visit_id`,`visit_ip`,`vendor_visitor_id`,`created_at`,`updated_at`) VALUES ('966634dc-0bf6-1ff7-f4b6-08000c95c670', '209', '134853732', '24.6.5.33', NULL, '2020-09-13 09:54:18.982497', '2020-09-13 09:54:18.982497'), ('3385a27a-cc20-8d98-940a-37dad5a93133', '209', '134849628', '24.6.5.33', NULL, '2020-09-13 09:54:18.982525', '2020-09-13 09:54:18.982525') ON DUPLICATE KEY UPDATE `evid`=`evid`
INSERT INTO `visits` (`evid`,`vendor_site_id`,`vendor_visit_id`,`visit_ip`,`vendor_visitor_id`,`created_at`,`updated_at`) VALUES ('966634dc-0bf6-1ff7-f4b6-08000c95c670', '209', '134853732', '24.6.5.33', NULL, '2020-09-13 10:43:16.737944', '2020-09-13 10:43:16.737944'), ('3385a27a-cc20-8d98-940a-37dad5a93133', '209', '134849628', '24.6.5.33', NULL, '2020-09-13 10:43:16.737974', '2020-09-13 10:43:16.737974') ON DUPLICATE KEY UPDATE `evid`=`evid`
---
  def save_visits
    hash_visits = []

    @visits.each do |visit|
      current_time = Time.current
      hash_visits << {  evid: visit['referrerName'].gsub('evid_', ''),
                        vendor_site_id: visit['idSite'],
                        vendor_visit_id: visit['idVisit'],
                        visit_ip: visit['visitIp'],
                        vendor_visitor_id: visit['visitorId'],
                        created_at: current_time,
                        updated_at: current_time}

    end

    hash_visits.present? ? Visit.insert_all(hash_visits) : false